In [1]:
%load_ext sql

In [2]:
 %sql sqlite://

'Connected: @None'

In [3]:
%%sql sqlite://
 CREATE TABLE COMPANY(
 ID INT PRIMARY KEY NOT NULL, NAME TEXT NOT NULL, AGE INT NOT NULL,ADDRESS CHAR(50),
 SALARY REAL)

Done.

[]

In [4]:
%sql INSERT INTO COMPANY VALUES (1, 'Paul', 32, 'California', 20000.00 )
%sql INSERT INTO COMPANY  VALUES (2, 'Allen', 25, 'Texas', 15000.00 )

%sql  INSERT INTO COMPANY  VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )

%sql INSERT INTO COMPANY  VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )

%sql  INSERT INTO COMPANY  VALUES (5, 'David', 27, 'Texas', 85000.00 )
%sql  INSERT INTO COMPANY VALUES (6, 'Kim', 22, 'South-Hall', 45000.00 )
%sql INSERT INTO COMPANY VALUES (10, 'Paul', 100, 'California', 80000.00 )

 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.

[]

In [5]:
result=%sql select * from COMPANY
print(result)

 * sqlite://
Done.
+----+-------+-----+------------+---------+
| ID |  NAME | AGE |  ADDRESS   |  SALARY |
+----+-------+-----+------------+---------+
| 1  |  Paul |  32 | California | 20000.0 |
| 2  | Allen |  25 |   Texas    | 15000.0 |
| 3  | Teddy |  23 |   Norway   | 20000.0 |
| 4  |  Mark |  25 | Rich-Mond  | 65000.0 |
| 5  | David |  27 |   Texas    | 85000.0 |
| 6  |  Kim  |  22 | South-Hall | 45000.0 |
| 10 |  Paul | 100 | California | 80000.0 |
+----+-------+-----+------------+---------+

In [6]:
%sql ALTER TABLE company RENAME TO recipes2

 * sqlite://
Done.

[]

In [7]:
result=%sql select * from recipes2
print(result)

 * sqlite://
Done.
+----+-------+-----+------------+---------+
| ID |  NAME | AGE |  ADDRESS   |  SALARY |
+----+-------+-----+------------+---------+
| 1  |  Paul |  32 | California | 20000.0 |
| 2  | Allen |  25 |   Texas    | 15000.0 |
| 3  | Teddy |  23 |   Norway   | 20000.0 |
| 4  |  Mark |  25 | Rich-Mond  | 65000.0 |
| 5  | David |  27 |   Texas    | 85000.0 |
| 6  |  Kim  |  22 | South-Hall | 45000.0 |
| 10 |  Paul | 100 | California | 80000.0 |
+----+-------+-----+------------+---------+

In [8]:
%sql alter table recipes2 add PH_NO int 
%sql select * from recipes2

 * sqlite://
Done.
 * sqlite://
Done.

[(1, 'Paul', 32, 'California', 20000.0, None),
 (2, 'Allen', 25, 'Texas', 15000.0, None),
 (3, 'Teddy', 23, 'Norway', 20000.0, None),
 (4, 'Mark', 25, 'Rich-Mond ', 65000.0, None),
 (5, 'David', 27, 'Texas', 85000.0, None),
 (6, 'Kim', 22, 'South-Hall', 45000.0, None),
 (10, 'Paul', 100, 'California', 80000.0, None)]

In [9]:
%sql update recipes2 set PH_NO='9764405042' where NAME='David'

 * sqlite://
1 rows affected.

[]

In [10]:
%sql select * from recipes2

 * sqlite://
Done.

[(1, 'Paul', 32, 'California', 20000.0, None),
 (2, 'Allen', 25, 'Texas', 15000.0, None),
 (3, 'Teddy', 23, 'Norway', 20000.0, None),
 (4, 'Mark', 25, 'Rich-Mond ', 65000.0, None),
 (5, 'David', 27, 'Texas', 85000.0, 9764405042),
 (6, 'Kim', 22, 'South-Hall', 45000.0, None),
 (10, 'Paul', 100, 'California', 80000.0, None)]

In [11]:
#AND
%sql SELECT * FROM recipes2 WHERE AGE >= 25 AND SALARY >= 65000;

 * sqlite://
Done.

[(4, 'Mark', 25, 'Rich-Mond ', 65000.0, None),
 (5, 'David', 27, 'Texas', 85000.0, 9764405042),
 (10, 'Paul', 100, 'California', 80000.0, None)]

In [12]:
#or
%sql SELECT * FROM recipes2 WHERE AGE >= 25 OR SALARY >= 65000;

 * sqlite://
Done.

[(1, 'Paul', 32, 'California', 20000.0, None),
 (2, 'Allen', 25, 'Texas', 15000.0, None),
 (4, 'Mark', 25, 'Rich-Mond ', 65000.0, None),
 (5, 'David', 27, 'Texas', 85000.0, 9764405042),
 (10, 'Paul', 100, 'California', 80000.0, None)]

In [13]:
#start with P
%sql SELECT * FROM recipes2 WHERE NAME LIKE 'P%';

 * sqlite://
Done.

[(1, 'Paul', 32, 'California', 20000.0, None),
 (10, 'Paul', 100, 'California', 80000.0, None)]

In [14]:
#end with y
%sql SELECT * FROM recipes2 WHERE NAME LIKE '%y';

 * sqlite://
Done.

[(3, 'Teddy', 23, 'Norway', 20000.0, None)]

In [15]:
#second letter with a
%sql SELECT * FROM recipes2 WHERE NAME LIKE '_a%';

 * sqlite://
Done.

[(1, 'Paul', 32, 'California', 20000.0, None),
 (4, 'Mark', 25, 'Rich-Mond ', 65000.0, None),
 (5, 'David', 27, 'Texas', 85000.0, 9764405042),
 (10, 'Paul', 100, 'California', 80000.0, None)]

In [16]:
#after a string
%sql SELECT * FROM recipes2 WHERE NAME LIKE 'A___%';

 * sqlite://
Done.

[(2, 'Allen', 25, 'Texas', 15000.0, None)]

In [17]:
#first letter a and last letter k string
%sql SELECT * FROM recipes2 WHERE NAME LIKE 'M%k';

 * sqlite://
Done.

[(4, 'Mark', 25, 'Rich-Mond ', 65000.0, None)]

In [18]:
%sql SELECT * FROM recipes2 LIMIT 4;

 * sqlite://
Done.

[(1, 'Paul', 32, 'California', 20000.0, None),
 (2, 'Allen', 25, 'Texas', 15000.0, None),
 (3, 'Teddy', 23, 'Norway', 20000.0, None),
 (4, 'Mark', 25, 'Rich-Mond ', 65000.0, None)]

In [19]:
%sql SELECT * FROM recipes2 ORDER BY (NAME) ASC;

 * sqlite://
Done.

[(2, 'Allen', 25, 'Texas', 15000.0, None),
 (5, 'David', 27, 'Texas', 85000.0, 9764405042),
 (6, 'Kim', 22, 'South-Hall', 45000.0, None),
 (4, 'Mark', 25, 'Rich-Mond ', 65000.0, None),
 (1, 'Paul', 32, 'California', 20000.0, None),
 (10, 'Paul', 100, 'California', 80000.0, None),
 (3, 'Teddy', 23, 'Norway', 20000.0, None)]

In [20]:
%sql SELECT * FROM RECIPES2 ORDER BY (NAME) DESC;

 * sqlite://
Done.

[(3, 'Teddy', 23, 'Norway', 20000.0, None),
 (1, 'Paul', 32, 'California', 20000.0, None),
 (10, 'Paul', 100, 'California', 80000.0, None),
 (4, 'Mark', 25, 'Rich-Mond ', 65000.0, None),
 (6, 'Kim', 22, 'South-Hall', 45000.0, None),
 (5, 'David', 27, 'Texas', 85000.0, 9764405042),
 (2, 'Allen', 25, 'Texas', 15000.0, None)]

In [21]:
SUM_SALARY=%sql SELECT SUM(SALARY) AS SUM_SALARY FROM RECIPES2
print(SUM_SALARY)
MAX_SALARY=%sql SELECT MAX(SALARY) AS MAX_SALARY FROM RECIPES2 
print(MAX_SALARY)
MIN_SALARY=%sql SELECT MIN(SALARY) AS MIN_SALARY FROM RECIPES2 
print(MIN_SALARY)
AVG_SALARY=%sql SELECT AVG(SALARY) AS AVG_SALARY FROM RECIPES2 
print(AVG_SALARY)
COUNT_SALARY=%sql SELECT Count(SALARY) AS COUNT_SALARY FROM RECIPES2
print(COUNT_SALARY)

 * sqlite://
Done.
+------------+
| SUM_SALARY |
+------------+
|  330000.0  |
+------------+
 * sqlite://
Done.
+------------+
| MAX_SALARY |
+------------+
|  85000.0   |
+------------+
 * sqlite://
Done.
+------------+
| MIN_SALARY |
+------------+
|  15000.0   |
+------------+
 * sqlite://
Done.
+--------------------+
|     AVG_SALARY     |
+--------------------+
| 47142.857142857145 |
+--------------------+
 * sqlite://
Done.
+--------------+
| COUNT_SALARY |
+--------------+
|      7       |
+--------------+

In [22]:
%sql SELECT	SUM(SALARY) AS SALARY,ADDRESS FROM RECIPES2 GROUP BY ADDRESS ORDER BY ADDRESS DESC;

 * sqlite://
Done.

[(100000.0, 'Texas'),
 (45000.0, 'South-Hall'),
 (65000.0, 'Rich-Mond '),
 (20000.0, 'Norway'),
 (100000.0, 'California')]

In [23]:
#1st highest salry
display=%sql select * from RECIPES2 order by salary desc
print(display)
%sql select max(salary)AS MAX from RECIPES2

 * sqlite://
Done.
+----+-------+-----+------------+---------+------------+
| ID |  NAME | AGE |  ADDRESS   |  SALARY |   PH_NO    |
+----+-------+-----+------------+---------+------------+
| 5  | David |  27 |   Texas    | 85000.0 | 9764405042 |
| 10 |  Paul | 100 | California | 80000.0 |    None    |
| 4  |  Mark |  25 | Rich-Mond  | 65000.0 |    None    |
| 6  |  Kim  |  22 | South-Hall | 45000.0 |    None    |
| 1  |  Paul |  32 | California | 20000.0 |    None    |
| 3  | Teddy |  23 |   Norway   | 20000.0 |    None    |
| 2  | Allen |  25 |   Texas    | 15000.0 |    None    |
+----+-------+-----+------------+---------+------------+
 * sqlite://
Done.

[(85000.0,)]

In [26]:
#2nd highest salry
%sql select salary from RECIPES2 where salary < ( select max(salary) from RECIPES2) order by (salary) desc LIMIT 1

 * sqlite://
Done.

[(80000.0,)]

In [30]:
%sql SELECT DISTINCT ADDRESS FROM RECIPES2

 * sqlite://
Done.

[('California',), ('Texas',), ('Norway',), ('Rich-Mond ',), ('South-Hall',)]

In [31]:
%sql SELECT count(ADDRESS),ADDRESS FROM RECIPES2 GROUP BY ADDRESS HAVING count(ADDRESS) > 1

 * sqlite://
Done.

[(2, 'California'), (2, 'Texas')]

In [32]:
%sql SELECT datetime('now');

 * sqlite://
Done.

[('2020-02-18 07:26:04',)]

In [33]:
%sql SELECT datetime('now','localtime');

 * sqlite://
Done.

[('2020-02-18 12:56:18',)]

In [34]:
%sql SELECT time('now')

 * sqlite://
Done.

[('07:26:31',)]

In [35]:
%sql SELECT time("now","localtime");

 * sqlite://
Done.

[('12:56:39',)]

In [36]:
%sql SELECT time('10:20:30','+2 hours');

 * sqlite://
Done.

[('12:20:30',)]

In [37]:
%sql SELECT  time('10:20:30','+1 hours','+20 minutes')

 * sqlite://
Done.

[('11:40:30',)]

In [44]:
%sql SELECT DATE('2018-11-01','+8 day');

 * sqlite://
Done.

[('2018-11-09',)]

In [39]:
%sql SELECT DATE('2018-11-01','-1 year');

 * sqlite://
Done.

[('2017-11-01',)]

In [40]:
%sql SELECT DATE('2018-11-01','-1 month');

 * sqlite://
Done.

[('2018-10-01',)]

In [41]:
%sql SELECT DATE('2018-11-01','+1 month');

 * sqlite://
Done.

[('2018-12-01',)]

In [45]:
%%sql sqlite://
CREATE TABLE CUSTOMERS(ID INT PRIMARY KEY,
NAME VARCHAR (20)  NOT NULL, AGE INT	NOT NULL, ADDRESS CHAR (25) ,
SALARY DECIMAL (18, 2)
);

Done.

[]

In [46]:
%sql INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)VALUES (1, 'Ramesh', 32, 'Ahmedabad', 2000.00 );

%sql INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY) VALUES (2, 'Khilan', 25, 'Delhi', 1500.00 );
%sql INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY) VALUES (3, 'kaushik', 23, 'Kota', 2000.00 );

%sql INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY) VALUES (4, 'jk', 23, 'pune', 4000.00 );
%sql INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY) VALUES (5, 'SID', 23, 'MUBAI', 5000.00 );
%sql INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY) VALUES (6, 'VIN', 23, 'NAGER', 6000.00 );

 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.

[]

In [47]:
%sql select * from CUSTOMERS

 * sqlite://
Done.

[(1, 'Ramesh', 32, 'Ahmedabad', 2000),
 (2, 'Khilan', 25, 'Delhi', 1500),
 (3, 'kaushik', 23, 'Kota', 2000),
 (4, 'jk', 23, 'pune', 4000),
 (5, 'SID', 23, 'MUBAI', 5000),
 (6, 'VIN', 23, 'NAGER', 6000)]

In [48]:
%sql CREATE TABLE ORDERS(OID INT PRIMARY KEY,CUSTOMER_ID int, AMOUNT int,FOREIGN KEY (CUSTOMER_ID  )REFERENCES CUSTOMERS (id))

 * sqlite://
Done.

[]

In [49]:
%sql insert into orders values(100,3,1500)
%sql insert into orders values(102,3,3000)
%sql insert into orders values(101,2,1560)
%sql insert into orders values(103,4,2060)

 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.
 * sqlite://
1 rows affected.

[]

In [50]:
ords=%sql select * from orders
cust=%sql select * from CUSTOMERS
print(cust)
print(ords)

 * sqlite://
Done.
 * sqlite://
Done.
+----+---------+-----+-----------+--------+
| ID |   NAME  | AGE |  ADDRESS  | SALARY |
+----+---------+-----+-----------+--------+
| 1  |  Ramesh |  32 | Ahmedabad |  2000  |
| 2  |  Khilan |  25 |   Delhi   |  1500  |
| 3  | kaushik |  23 |    Kota   |  2000  |
| 4  |    jk   |  23 |    pune   |  4000  |
| 5  |   SID   |  23 |   MUBAI   |  5000  |
| 6  |   VIN   |  23 |   NAGER   |  6000  |
+----+---------+-----+-----------+--------+
+-----+-------------+--------+
| OID | CUSTOMER_ID | AMOUNT |
+-----+-------------+--------+
| 100 |      3      |  1500  |
| 102 |      3      |  3000  |
| 101 |      2      |  1560  |
| 103 |      4      |  2060  |
+-----+-------------+--------+

In [51]:
inner=%sql SELECT ID, NAME, AMOUNT FROM CUSTOMERS INNER JOIN ORDERS ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID;
print(cust)
print(ords)
print(inner)

 * sqlite://
Done.
+----+---------+-----+-----------+--------+
| ID |   NAME  | AGE |  ADDRESS  | SALARY |
+----+---------+-----+-----------+--------+
| 1  |  Ramesh |  32 | Ahmedabad |  2000  |
| 2  |  Khilan |  25 |   Delhi   |  1500  |
| 3  | kaushik |  23 |    Kota   |  2000  |
| 4  |    jk   |  23 |    pune   |  4000  |
| 5  |   SID   |  23 |   MUBAI   |  5000  |
| 6  |   VIN   |  23 |   NAGER   |  6000  |
+----+---------+-----+-----------+--------+
+-----+-------------+--------+
| OID | CUSTOMER_ID | AMOUNT |
+-----+-------------+--------+
| 100 |      3      |  1500  |
| 102 |      3      |  3000  |
| 101 |      2      |  1560  |
| 103 |      4      |  2060  |
+-----+-------------+--------+
+----+---------+--------+
| ID |   NAME  | AMOUNT |
+----+---------+--------+
| 3  | kaushik |  1500  |
| 3  | kaushik |  3000  |
| 2  |  Khilan |  1560  |
| 4  |    jk   |  2060  |
+----+---------+--------+

In [53]:
LEFT_JOIN= %sql SELECT ID, NAME,age,ADDRESS, AMOUNT,SALARY FROM CUSTOMERS LEFT JOIN ORDERS ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID
print(cust)
print(ords)
print(LEFT_JOIN)

 * sqlite://
Done.
+----+---------+-----+-----------+--------+
| ID |   NAME  | AGE |  ADDRESS  | SALARY |
+----+---------+-----+-----------+--------+
| 1  |  Ramesh |  32 | Ahmedabad |  2000  |
| 2  |  Khilan |  25 |   Delhi   |  1500  |
| 3  | kaushik |  23 |    Kota   |  2000  |
| 4  |    jk   |  23 |    pune   |  4000  |
| 5  |   SID   |  23 |   MUBAI   |  5000  |
| 6  |   VIN   |  23 |   NAGER   |  6000  |
+----+---------+-----+-----------+--------+
+-----+-------------+--------+
| OID | CUSTOMER_ID | AMOUNT |
+-----+-------------+--------+
| 100 |      3      |  1500  |
| 102 |      3      |  3000  |
| 101 |      2      |  1560  |
| 103 |      4      |  2060  |
+-----+-------------+--------+
+----+---------+-----+-----------+--------+--------+
| ID |   NAME  | AGE |  ADDRESS  | AMOUNT | SALARY |
+----+---------+-----+-----------+--------+--------+
| 1  |  Ramesh |  32 | Ahmedabad |  None  |  2000  |
| 2  |  Khilan |  25 |   Delhi   |  1560  |  1500  |
| 3  | kaushik |  23 |    Kota   |  1500  |  2000  |
| 3  | kaushik |  23 |    Kota   |  3000  |  2000  |
| 4  |    jk   |  23 |    pune   |  2060  |  4000  |
| 5  |   SID   |  23 |   MUBAI   |  None  |  5000  |
| 6  |   VIN   |  23 |   NAGER   |  None  |  6000  |
+----+---------+-----+-----------+--------+--------+

In [54]:
%sql SELECT * FROM CUSTOMERS a, CUSTOMERS b WHERE a.SALARY=b.SALARY and a.NAME='kaushik'

 * sqlite://
Done.

[(3, 'kaushik', 23, 'Kota', 2000, 1, 'Ramesh', 32, 'Ahmedabad', 2000),
 (3, 'kaushik', 23, 'Kota', 2000, 3, 'kaushik', 23, 'Kota', 2000)]

In [57]:
%sql SELECT b.NAME FROM CUSTOMERS a, CUSTOMERS b WHERE a.SALARY=b.SALARY and a.NAME='kaushik'

 * sqlite://
Done.

[('Ramesh',), ('kaushik',)]

In [58]:
%sql SELECT	a.ID, b.NAME, a.SALARY FROM CUSTOMERS a, CUSTOMERS b WHERE a.SALARY < b.SALARY;

 * sqlite://
Done.

[(1, 'jk', 2000),
 (1, 'SID', 2000),
 (1, 'VIN', 2000),
 (2, 'Ramesh', 1500),
 (2, 'kaushik', 1500),
 (2, 'jk', 1500),
 (2, 'SID', 1500),
 (2, 'VIN', 1500),
 (3, 'jk', 2000),
 (3, 'SID', 2000),
 (3, 'VIN', 2000),
 (4, 'SID', 4000),
 (4, 'VIN', 4000),
 (5, 'VIN', 5000)]

In [59]:
CART_join=%sql SELECT ID, NAME,CUSTOMER_ID ,AMOUNT FROM CUSTOMERS, ORDERS;
print(cust)
print(ords)
print(CART_join)

 * sqlite://
Done.
+----+---------+-----+-----------+--------+
| ID |   NAME  | AGE |  ADDRESS  | SALARY |
+----+---------+-----+-----------+--------+
| 1  |  Ramesh |  32 | Ahmedabad |  2000  |
| 2  |  Khilan |  25 |   Delhi   |  1500  |
| 3  | kaushik |  23 |    Kota   |  2000  |
| 4  |    jk   |  23 |    pune   |  4000  |
| 5  |   SID   |  23 |   MUBAI   |  5000  |
| 6  |   VIN   |  23 |   NAGER   |  6000  |
+----+---------+-----+-----------+--------+
+-----+-------------+--------+
| OID | CUSTOMER_ID | AMOUNT |
+-----+-------------+--------+
| 100 |      3      |  1500  |
| 102 |      3      |  3000  |
| 101 |      2      |  1560  |
| 103 |      4      |  2060  |
+-----+-------------+--------+
+----+---------+-------------+--------+
| ID |   NAME  | CUSTOMER_ID | AMOUNT |
+----+---------+-------------+--------+
| 1  |  Ramesh |      3      |  1500  |
| 1  |  Ramesh |      3      |  3000  |
| 1  |  Ramesh |      2      |  1560  |
| 1  |  Ramesh |      4      |  2060  |
| 2  |  Khilan |      3      |  1500  |
| 2  |  Khilan |      3      |  3000  |
| 2  |  Khilan |      2      |  1560  |
| 2  |  Khilan |      4      |  2060  |
| 3  | kaushik |      3      |  1500  |
| 3  | kaushik |      3      |  3000  |
| 3  | kaushik |      2      |  1560  |
| 3  | kaushik |      4      |  2060  |
| 4  |    jk   |      3      |  1500  |
| 4  |    jk   |      3      |  3000  |
| 4  |    jk   |      2      |  1560  |
| 4  |    jk   |      4      |  2060  |
| 5  |   SID   |      3      |  1500  |
| 5  |   SID   |      3      |  3000  |
| 5  |   SID   |      2      |  1560  |
| 5  |   SID   |      4      |  2060  |
| 6  |   VIN   |      3      |  1500  |
| 6  |   VIN   |      3      |  3000  |
| 6  |   VIN   |      2      |  1560  |
| 6  |   VIN   |      4      |  2060  |
+----+---------+-------------+--------+

In [61]:
%sql Select ID,ADDRESS,AGE from CUSTOMERS WHERE NAME IN (select NAMe from CUSTOMERS where id=3)

 * sqlite://
Done.

[(3, 'Kota', 23)]

In [62]:
%sql update CUSTOMERS set salary=salary+10000 WHERE ID	IN (select CUSTOMER_ID FROM ORDERS WHERE CUSTOMERS.id=ORDERS.CUSTOMER_ID and AMOUNT= '1500')

 * sqlite://
1 rows affected.

[]

In [63]:
%sql select * from customers

 * sqlite://
Done.

[(1, 'Ramesh', 32, 'Ahmedabad', 2000),
 (2, 'Khilan', 25, 'Delhi', 1500),
 (3, 'kaushik', 23, 'Kota', 12000),
 (4, 'jk', 23, 'pune', 4000),
 (5, 'SID', 23, 'MUBAI', 5000),
 (6, 'VIN', 23, 'NAGER', 6000)]